name: "bookyolo_detect"
backend: "python"
max_batch_size: 0

input [
  {
    name: "INPUT_IMAGE"
    data_type: TYPE_UINT8
    dims: [ -1, -1, 3 ]
  },
  {
    name: "thr"
    data_type: TYPE_FP32
    dims: [ 1 ]
  },
  {
    name: "worker"
    data_type: TYPE_INT32
    dims: [ 1 ]
  }
]

output [
  {
    name: "output_rects"
    data_type: TYPE_FP32
    dims: [ -1, 5 ]
  }
]